Security and quality (#334)
